Autodesk.Revit.DB.BasePoint.GetSurveyPoint(Autodesk.Revit.DB.Document)
Gets the survey point for the document.
cda:
The document from which to get the survey point.
Returns:
The survey point of the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020.2

Autodesk.Revit.DB.BasePoint.GetProjectBasePoint(Autodesk.Revit.DB.Document)
Gets the project base point for the document.
cda:
The document from which to get the project base point.
Returns:
The project base point of the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020.2

Autodesk.Revit.DB.BasePoint.SharedPosition
Shared position of the BasePoint based on the active ProjectLocation of its belonging Document.
To get the shared position under other ProjectLocations, please use ProjectLocation.GetProjectPosition(BasePoint.Position).
Since:
2019.2

Autodesk.Revit.DB.BasePoint.Clipped
Clipped state of the survey point (shared BasePoint). Change its state to clipped or unclipped, depending on how you want to move the survey point.
To move the survey coordinate system in relation to the model, move the clipped survey point.
To change the survey point to another location in the survey coordinate system, move the unclipped survey point.
For project base point (non-shared BasePoint), this property will always return false. Trying to set the property will get an InvalidOperationException.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation is only available for a shared BasePoint.
Since:
2021.1